In [8]:
import pandas as pd

In [9]:
data={'Name':['Nahid','Mamun','Mahmud','Khan'],
     'Location':['RAJ','CTG','DHK','MS'],
     'Age':[29,28,29,25]}

In [10]:
frame=pd.DataFrame(data)

In [11]:
frame

     Name Location  Age
0   Nahid      RAJ   29
1   Mamun      CTG   28
2  Mahmud      DHK   29
3    Khan       MS   25

In [12]:
display(frame[frame.Age>25])

     Name Location  Age
0   Nahid      RAJ   29
1   Mamun      CTG   28
2  Mahmud      DHK   29